Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70Q20.xml
        <module name="QSPI" version="11171B">
          <instance name="QSPI">
            <register-group address-space="base" name="QSPI" name-in-module="QSPI" offset="0x4007C000"/>
            <signals>
              <signal pad="PA11" function="A" group="QCS"/>
              <signal pad="PA13" function="A" group="QIO" index="0"/>
              <signal pad="PA12" function="A" group="QIO" index="1"/>
              <signal pad="PA17" function="A" group="QIO" index="2"/>
              <signal pad="PD31" function="A" group="QIO" index="3"/>
              <signal pad="PA14" function="A" group="QSCK"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009I">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1800"/>
          </instance>
        </module>
        <module name="RSWDT" version="11110D">
          <instance name="RSWDT">
            <register-group address-space="base" name="RSWDT" name-in-module="RSWDT" offset="0x400E1900"/>
          </instance>
        </module>
        <module name="RTC" version="6056T">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1860"/>
          </instance>
        </module>
        <module name="RTT" version="6081M">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1830"/>
          </instance>
        </module>
        <module name="SDRAMC" version="6100Q">
          <instance name="SDRAMC">
            <register-group address-space="base" name="SDRAMC" name-in-module="SDRAMC" offset="0x40084000"/>
          </instance>
        </module>
        <module name="SMC" version="6498H">
          <instance name="SMC">
            <register-group address-space="base" name="SMC" name-in-module="SMC" offset="0x40080000"/>
          </instance>
        </module>
        <module name="SPI" version="6088ZF">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PD20" function="B" group="SPI0_MISO"/>
              <signal pad="PD21" function="B" group="SPI0_MOSI"/>
              <signal pad="PB2" function="D" group="SPI0_NPCS" index="0"/>
              <signal pad="PA31" function="A" group="SPI0_NPCS" index="1"/>
              <signal pad="PD25" function="B" group="SPI0_NPCS" index="1"/>
              <signal pad="PD12" function="C" group="SPI0_NPCS" index="2"/>
              <signal pad="PD27" function="B" group="SPI0_NPCS" index="3"/>
              <signal pad="PD22" function="B" group="SPI0_SPCK"/>
            </signals>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0x40058000"/>
            <signals>
              <signal pad="PC26" function="C" group="SPI1_MISO"/>
              <signal pad="PC27" function="C" group="SPI1_MOSI"/>
              <signal pad="PC25" function="C" group="SPI1_NPCS" index="0"/>
              <signal pad="PC28" function="C" group="SPI1_NPCS" index="1"/>
              <signal pad="PD0" function="C" group="SPI1_NPCS" index="1"/>
              <signal pad="PC29" function="C" group="SPI1_NPCS" index="2"/>
              <signal pad="PD1" function="C" group="SPI1_NPCS" index="2"/>
              <signal pad="PC30" function="C" group="SPI1_NPCS" index="3"/>
              <signal pad="PD2" function="C" group="SPI1_NPCS" index="3"/>
              <signal pad="PC24" function="C" group="SPI1_SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SSC" version="6078O">
          <instance name="SSC">
            <register-group address-space="base" name="SSC" name-in-module="SSC" offset="0x40004000"/>
            <signals>
              <signal pad="PA10" function="C" group="RD"/>
              <signal pad="PD24" function="B" group="RF"/>
              <signal pad="PA22" function="A" group="RK"/>
              <signal pad="PB5" function="D" group="TD"/>
              <signal pad="PD10" function="C" group="TD"/>
              <signal pad="PD26" function="B" group="TD"/>
              <signal pad="PB0" function="D" group="TF"/>
              <signal pad="PB1" function="D" group="TK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" version="6452Z">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1810"/>
          </instance>
        </module>
        <module name="TC" version="6082ZD">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x4000C000"/>
            <signals>
              <signal pad="PA4" function="B" group="TCLK" index="0"/>
              <signal pad="PA28" function="B" group="TCLK" index="1"/>
              <signal pad="PA29" function="B" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA15" function="B" group="TIOA" index="1"/>
              <signal pad="PA26" function="B" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA27" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PC25" function="B" group="TCLK" index="3"/>
              <signal pad="PC28" function="B" group="TCLK" index="4"/>
              <signal pad="PC31" function="B" group="TCLK" index="5"/>
              <signal pad="PC23" function="B" group="TIOA" index="3"/>
              <signal pad="PC26" function="B" group="TIOA" index="4"/>
              <signal pad="PC29" function="B" group="TIOA" index="5"/>
              <signal pad="PC24" function="B" group="TIOB" index="3"/>
              <signal pad="PC27" function="B" group="TIOB" index="4"/>
              <signal pad="PC30" function="B" group="TIOB" index="5"/>
            </signals>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40014000"/>
            <signals>
              <signal pad="PC7" function="B" group="TCLK" index="6"/>
              <signal pad="PC10" function="B" group="TCLK" index="7"/>
              <signal pad="PC14" function="B" group="TCLK" index="8"/>
              <signal pad="PC5" function="B" group="TIOA" index="6"/>
              <signal pad="PC8" function="B" group="TIOA" index="7"/>
              <signal pad="PC11" function="B" group="TIOA" index="8"/>
              <signal pad="PC6" function="B" group="TIOB" index="6"/>
              <signal pad="PC9" function="B" group="TIOB" index="7"/>
              <signal pad="PC12" function="B" group="TIOB" index="8"/>
            </signals>
          </instance>
          <instance name="TC3">
            <register-group address-space="base" name="TC3" name-in-module="TC" offset="0x40054000"/>
            <signals>
              <signal pad="PE2" function="B" group="TCLK" index="9"/>
              <signal pad="PE5" function="B" group="TCLK" index="10"/>
              <signal pad="PD24" function="C" group="TCLK" index="11"/>
              <signal pad="PE0" function="B" group="TIOA" index="9"/>
              <signal pad="PE3" function="B" group="TIOA" index="10"/>
              <signal pad="PD21" function="C" group="TIOA" index="11"/>
              <signal pad="PE1" function="B" group="TIOB" index="9"/>
              <signal pad="PE4" function="B" group="TIOB" index="10"/>
              <signal pad="PD22" function="C" group="TIOB" index="11"/>
            </signals>
          </instance>
        </module>
        <module name="TRNG" version="6334E">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x40070000"/>
